/****************************************************************************************
删除无序向量中重复元素（繁琐版）：
1.先记录原始规模
2.从头开始访问一个元素
3.依次访问其所有后继与该元素进行比较，若相等则删除该后继
4.访问接下来的元素
***************************************************************************************/
template <typename T>
int Vector<T>::deduplicate()
{	
	int oldsize = _size ;
	int i = -1 ; //从最前端开始


	while (++i < _size - 1) //直至倒数第二个元素	
		int j = i + 1;
		while ( j < _size )//访问其后继，直至最后一个元素
			if( elem[i] == elem[j] )  remove( j );//若相同则删除该元素
				else j++;

	return oldsize - _size ;//返回被删除元素总数
}
